tap "anomalyco/tap"
tap "derailed/k9s"
tap "hashicorp/tap"
tap "humanlayer/humanlayer"
tap "int128/kubelogin"
tap "marcus/tap"
tap "nikitabobko/tap"
brew "tree"
brew "ansible"
brew "astro"
brew "awscli"
brew "bat"
brew "claude-cmd"
brew "curl"
brew "detect-secrets"
brew "duf"
brew "dust"
brew "eza"
brew "fd"
brew "ffmpeg"
brew "fswatch"
brew "fzf"
brew "gh"
brew "git"
brew "git-secrets"
brew "gitleaks"
brew "go"
brew "gum"
brew "helm"
brew "htop"
brew "ical-buddy"
brew "jq"
brew "lazydocker"
brew "lazygit"
brew "lazysql"
brew "mas"
brew "mysql-client", link: true
brew "node@22"
brew "openjdk@21"
brew "pgcli"
brew "pipx"
brew "poppler"
brew "postgresql@18", link: true
brew "pre-commit"
brew "pyenv"
brew "rainfrog"
brew "ripgrep"
brew "shellcheck"
brew "shfmt"
brew "silicon"
brew "sox"
brew "starship"
brew "stow"
brew "tmux"
brew "uv"
brew "wget"
brew "whisper-cpp"
brew "yamlfmt"
brew "yazi"
brew "yq"
brew "zoxide"
brew "zsh"
brew "anomalyco/tap/opencode"
brew "derailed/k9s/k9s"
brew "hashicorp/tap/terraform"
brew "hashicorp/tap/vault"
brew "int128/kubelogin/kubelogin"
brew "marcus/tap/nightshift"
brew "marcus/tap/td"
cask "1password"
cask "1password-cli"
cask "nikitabobko/tap/aerospace"
cask "appcleaner"
cask "arc"
cask "bambu-studio"
cask "betterzip"
cask "blackhole-2ch"
cask "caffeine"
cask "claude"
cask "cleanmymac"
cask "codex"
cask "discord"
cask "docker-desktop"
cask "elgato-control-center"
cask "elgato-stream-deck"
cask "font-fira-code"
cask "font-fira-code-nerd-font"
cask "font-hack-nerd-font"
cask "font-jetbrains-mono"
cask "font-jetbrains-mono-nerd-font"
cask "freedom"
cask "ghostty"
cask "google-drive"
cask "imageoptim"
cask "infra"
cask "maccy"
cask "notion"
cask "notion-calendar"
cask "notunes"
cask "obsidian"
cask "ollama-app"
cask "orbstack"
cask "postman"
cask "qlmarkdown"
cask "raycast"
cask "rectangle"
cask "humanlayer/humanlayer/riptide-beta"
cask "slack"
cask "spotify"
cask "stats"
cask "sunsama"
cask "superduper"
cask "suspicious-package"
cask "todoist-app"
cask "visual-studio-code"
cask "warp"
mas "Goodnotes", id: 1444383602
mas "Okta Verify", id: 490179405
mas "Pages", id: 361309726
mas "Toggl Track", id: 1291898086
vscode "1password.op-vscode"
vscode "altimateai.vscode-altimate-mcp-server"
vscode "amazonwebservices.aws-toolkit-vscode"
vscode "anthropic.claude-code"
vscode "anysphere.cursorpyright"
vscode "anysphere.remote-ssh"
vscode "charliermarsh.ruff"
vscode "christian-kohler.path-intellisense"
vscode "dbcode.dbcode"
vscode "dbtlabsinc.dbt"
vscode "dracula-theme.theme-dracula"
vscode "eamodio.gitlens"
vscode "enkia.tokyo-night"
vscode "esbenp.prettier-vscode"
vscode "file-icons.file-icons"
vscode "formulahendry.code-runner"
vscode "github.vscode-github-actions"
vscode "hbenl.vscode-test-explorer"
vscode "innoverio.vscode-dbt-power-user"
vscode "littlefoxteam.vscode-python-test-adapter"
vscode "mblode.pretty-formatter"
vscode "mechatroner.rainbow-csv"
vscode "mhutchie.git-graph"
vscode "ms-azuretools.vscode-containers"
vscode "ms-azuretools.vscode-docker"
vscode "ms-python.black-formatter"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode.makefile-tools"
vscode "ms-vscode.test-adapter-converter"
vscode "mtxr.sqltools"
vscode "mtxr.sqltools-driver-pg"
vscode "openai.chatgpt"
vscode "pkief.material-icon-theme"
vscode "redhat.vscode-yaml"
vscode "repreng.csv"
vscode "samuelcolvin.jinjahtml"
vscode "sqlfluff.vscode-sqlfluff"
vscode "streetsidesoftware.code-spell-checker"
vscode "usernamehw.errorlens"
vscode "yzhang.markdown-all-in-one"
go "github.com/marcus/sidecar/cmd/sidecar"
go "github.com/marcus/td"
uv "cora"
npm "@brdemorin/google-docs-mcp-server"
npm "@earendil-works/pi-coding-agent"
npm "node-gyp"
npm "oh-my-claude-sisyphus"
npm "remodex"
