# Taps
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"

# CLI Tools
brew "1password-cli" # 1Password CLI
brew "ag"            # Supercharged grep
brew "bat"           # Better cat
brew "dust"          # Better du
brew "duf"           # Better df
brew "eza"           # Better ls
brew "fd"            # Better find
brew "gitmoji"       # Emoji git commits
brew "htop"          # Better top
brew "ripgrep"       # Better grep
brew "stow"          # Symlink farm manager
brew "zsh"           # Modern shell
brew "starship"      # Cross-shell prompt
brew "curl"          # URL transfer tool
brew "fzf"           # Fuzzy finder
brew "gh"            # GitHub CLI
brew "git"           # Version control
brew "jq"            # JSON processor
brew "mas"           # Mac App Store CLI
brew "mysides"
brew "uv"            # Python package installer and resolver
brew "pyenv"         # Python version management
brew "tldr"          # Man pages simplified
brew "tree"          # Directory listings
brew "zoxide"        # Better cd
brew "wget"          # File downloader

# Development Tools
cask "cursor"             # AI-powered code editor
cask "docker"            # Containerization
cask "orbstack"          # Docker alternative
cask "postman"           # API testing
cask "visual-studio-code"  # Code editor
cask "warp"              # Modern terminal
brew "shfmt"            # Shell script formatter
brew "yamlfmt"          # YAML formatter

# AI/ML Tools
cask "ollama"           # Local AI models

# Productivity
cask "1password"        # Password manager
cask "arc", args: { quit: false } # Browser - prevent quitting on last window close
cask "discord"          # Community chat
cask "freedom"          # App and website blocker
cask "google-drive"     # Cloud storage
cask "notion"           # Notes and organization
cask "notion-calendar"  # Calendar integration
cask "obsidian"         # Note taking
cask "raycast"          # Spotlight replacement
cask "rectangle"        # Window management
cask "slack"            # Team communication
cask "spotify"          # Music streaming
cask "sunsama"          # Daily planner
cask "todoist"          # To-do list
cask "zoom"             # Video calls

# 3D Printing
cask "balenaetcher"     # USB writer
cask "bambu-studio"     # 3D printing slicer
cask "prusaslicer"      # 3D printing slicer

# Utilities
cask "appcleaner"       # App uninstaller
cask "caffeine"         # Prevent sleep
cask "cleanmymac"       # System cleaner
cask "elgato-control-center" # Control Elgato key lights
cask "elgato-stream-deck"    # Stream Deck control
cask "gimp"             # Image editor
cask "imageoptim"       # Image optimization
cask "maccy"            # Clipboard manager -X
cask "notunes"          # Prevent Apple Music from launching
cask "stats"            # System monitoring
cask "superduper"       # Backup tool

# Fonts
cask "font-fira-code"
cask "font-hack-nerd-font"
cask "font-jetbrains-mono"

# Quick Look Plugins
cask "qlcolorcode"        # Preview source code with syntax highlighting
cask "qlstephen"         # Preview plain text files without extension
cask "qlmarkdown"        # Preview Markdown files
cask "quicklook-json"    # Preview JSON files
cask "qlprettypatch"     # Preview patch files
cask "quicklook-csv"     # Preview CSV files
cask "betterzip"         # Preview archives
cask "webpquicklook"     # Preview WebP images
cask "suspicious-package" # Preview macOS installer packages

# Security Tools
brew "detect-secrets"   # Secret detection tool
brew "git-secrets"      # AWS credential scanning
